<!-- ------------------------------------------------------------------- -->
<!--                                                                     -->
<!--  record.xml              Utils documentation                        -->
<!--                                                                     -->
<!--  Copyright (C) 2015-2018, The GAP Group                             --> 
<!--                                                                     -->
<!-- ------------------------------------------------------------------- -->

<?xml version="1.0" encoding="UTF-8"?>

<Chapter Label="chap-record">
<Heading>Records</Heading>

<Section Label="sec-records">
<Heading>Functions for records</Heading>

<ManSection>
   <Func Name="AssignGlobals"
         Arg="rec" />
<Description>
This function has been transferred from package &RCWA;.
<P/>
It assigns the record components of <A>rec</A>
to global variables with the same names.
<P/>
</Description>
</ManSection>
<Example>
<![CDATA[
gap> r := rec( a := 1, b := 2, c := 3 );;                                      
gap> AssignGlobals( r );
The following global variables have been assigned:
[ "a", "b", "c" ]
gap> [a,b,c];
[ 1, 2, 3 ]
]]>
</Example> 

</Section> 

<Section Label="sec-options"> 
<Heading>Option records for functions</Heading> 

<ManSection>
   <Func Name="OptionRecordWithDefaults"
         Arg="defaults, useroptions" />
<Description>

This function simplifies handling records which are intended
to be used for expressing configuration options. <A>defaults</A>
represents the "default record", and <A>useroptions</A> lets
the user give new values for values in <A>defaults</A>.
<P/>
The function returns a record with the same component names
as <A>defaults</A> and which has the same values as <A>defaults</A>,
except for those component names in <A>useroptions</A>, where
the values in <A>useroptions</A> are used instead.

An error is given if <A>useroptions</A> contains any
component names not in <A>defaults</A>.

This function is designed to support functions with optional arguments 
given as a variable record, such as <C>function(x,y,options...)</C>. 
To support this, if <A>useroptions</A> is an empty list 
it is treated as an empty record, 
and if <A>useroptions</A> is a list of length <M>1</M> containing a record, 
this record is used as <A>useroptions</A>.
<P/>
</Description>
</ManSection>
<Example>
<![CDATA[
gap> defaults := rec( a := 1, b := 2, c := 3 );;
gap> OptionRecordWithDefaults( defaults, rec( a := 6) );
rec( a := 6, b := 2, c := 3 )
gap> OptionRecordWithDefaults( defaults, rec( b := 7, c := 8 ) );
rec( a := 1, b := 7, c := 8 )
gap> OptionRecordWithDefaults( defaults, [ ] );
rec( a := 1, b := 2, c := 3 )
gap> OptionRecordWithDefaults( defaults, [ rec( c := 8 ) ] );
rec( a := 1, b := 2, c := 8 )
gap> OptionRecordWithDefaults( defaults, rec( d := 9 ) );
Error, Unknown option: d
gap> OptionRecordWithDefaults( defaults, [ rec( b := 7 ), rec( c := 8 ) ] );
Error, Too many arguments for function
gap> OptionRecordWithDefaults( defaults, [6,7,8] );
Error, Too many arguments for function
]]>
</Example>

</Section>

</Chapter>
